
&После("ПриНачалеРаботыСистемы")
Процедура соПриНачалеРаботыСистемы()
	
	Если СтрНайти(ПараметрЗапуска, "ОтключитьСтартовыеОкна") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = соСтартовыеОкнаВызовСервера.ЗагрузитьНастройкиДляАвтоматическогоОткрытия();
	НастройкиПодсистемы = Настройки.НастройкиПодсистемы;
	ВажноеИзбранное = Настройки.ВажноеИзбранное;
	
	Если НастройкиПодсистемы.ВариантАвтоматическогоОткрытия = "Отключить" Тогда
		
		Возврат;
		
	ИначеЕсли НастройкиПодсистемы.ВариантАвтоматическогоОткрытия = "ВажныеИзбранные" Тогда
		
		Для каждого Ссылка Из ВажноеИзбранное Цикл
			соСтартовыеОкнаКлиент.ПопытатьсяПерейтиПоНавигационнойСсылке(Ссылка);
		КонецЦикла;
		
	ИначеЕсли НастройкиПодсистемы.ВариантАвтоматическогоОткрытия = "ФиксированныйСписок"
		Или НастройкиПодсистемы.ВариантАвтоматическогоОткрытия = "ОткрытыеОкна" Тогда
		
		Для каждого Ссылка Из НастройкиПодсистемы.ОткрываемыеНавигационныеСсылки Цикл
			соСтартовыеОкнаКлиент.ПопытатьсяПерейтиПоНавигационнойСсылке(Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Если НастройкиПодсистемы.ВариантАвтоматическогоОткрытия = "ОткрытыеОкна" Тогда
		соСтартовыеОкнаКлиент.ПодключитьОбработчикОжиданияСохраненияОткрытыхОкон();
	КонецЕсли;
	
КонецПроцедуры

Процедура соСохранитьОткрываемыеНавигационныеСсылки() Экспорт
	
	Окна = ПолучитьОкна();
	
	НавигационныеСсылки = Новый Массив;
	
	// Новые окна добавляются в начало коллекции ОкнаКлиентскогоПриложения
	Индекс = Окна.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Окно = Окна[Индекс];
		НавигационныеСсылки.Добавить(Окно.ПолучитьНавигационнуюСсылку());
		Индекс = Индекс - 1;
	КонецЦикла;
	
	соСтартовыеОкнаВызовСервера.СохранитьОткрываемыеНавигационныеСсылки(НавигационныеСсылки);
	
КонецПроцедуры

