#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьНастройки();
	
	ОбновитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантАвтоматическогоОткрытияПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
	Если ВариантАвтоматическогоОткрытия = "ОткрытыеОкна" Тогда
		соСтартовыеОкнаКлиент.ПодключитьОбработчикОжиданияСохраненияОткрытыхОкон();
	Иначе
		соСтартовыеОкнаКлиент.ОтключитьОбработчикОжиданияСохраненияОткрытыхОкон();
	КонецЕсли;
	
	СохранитьНастройки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройки()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ВариантАвтоматическогоОткрытия", ВариантАвтоматическогоОткрытия);
	Настройки.Вставить("ОткрываемыеНавигационныеСсылки", ОткрываемыеНавигационныеСсылки.ВыгрузитьЗначения());
	Настройки.Вставить("ИнтервалСохраненияОткрытыхОкон", ИнтервалСохраненияОткрытыхОкон);
	
	соСтартовыеОкна.СохранитьНастройки(Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	
	Настройки = соСтартовыеОкна.ЗагрузитьНастройки();
	
	ВариантАвтоматическогоОткрытия = Настройки.ВариантАвтоматическогоОткрытия;
	ОткрываемыеНавигационныеСсылки.ЗагрузитьЗначения(Настройки.ОткрываемыеНавигационныеСсылки);
	ИнтервалСохраненияОткрытыхОкон = Настройки.ИнтервалСохраненияОткрытыхОкон;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрываемыеНавигационныеСсылкиПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступность()
	
	Если ВариантАвтоматическогоОткрытия = "ФиксированныйСписок" Тогда
		Элементы.ОткрываемыеНавигационныеСсылки.Видимость = Истина;
	Иначе
		Элементы.ОткрываемыеНавигационныеСсылки.Видимость = Ложь;
	КонецЕсли;
	
	Если ВариантАвтоматическогоОткрытия = "ОткрытыеОкна" Тогда
		Элементы.ИнтервалСохраненияОткрытыхОкон.Видимость = Истина;
	Иначе
		Элементы.ИнтервалСохраненияОткрытыхОкон.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалСохраненияОткрытыхОконПриИзменении(Элемент)
	
	СохранитьНастройки();
	соСтартовыеОкнаКлиент.ОтключитьОбработчикОжиданияСохраненияОткрытыхОкон();
	соСтартовыеОкнаКлиент.ПодключитьОбработчикОжиданияСохраненияОткрытыхОкон();
	
КонецПроцедуры

#КонецОбласти



