#Область СлужебныйПрограммныйИнтерфейс

Процедура ПодключитьОбработчикОжиданияСохраненияОткрытыхОкон() Экспорт
	
	Настройки = соСтартовыеОкнаВызовСервера.ЗагрузитьНастройкиДляАвтоматическогоОткрытия();
	Интервал = Настройки.НастройкиПодсистемы.ИнтервалСохраненияОткрытыхОкон;
	
	ПодключитьОбработчикОжидания("соСохранитьОткрываемыеНавигационныеСсылки", Интервал);
КонецПроцедуры

Процедура ОтключитьОбработчикОжиданияСохраненияОткрытыхОкон() Экспорт
	ОтключитьОбработчикОжидания("соСохранитьОткрываемыеНавигационныеСсылки");
КонецПроцедуры

Функция ПопытатьсяПерейтиПоНавигационнойСсылке(Ссылка) Экспорт
	Попытка
		ПерейтиПоНавигационнойСсылке(Ссылка);
		Возврат Истина;
	Исключение
		соСтартовыеОкнаВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
КонецФункции

#КонецОбласти
