#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьНастройкиДляАвтоматическогоОткрытия() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("НастройкиПодсистемы", соСтартовыеОкна.ЗагрузитьНастройки());
	Настройки.Вставить("ВажноеИзбранное", соСтартовыеОкна.ВажноеИзбранное());
	
	Возврат Настройки;
	
КонецФункции

Процедура СохранитьОткрываемыеНавигационныеСсылки(НавигационныеСсылки) Экспорт
	
	соСтартовыеОкна.СохранитьОткрываемыеНавигационныеСсылки(НавигационныеСсылки);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурналРегистрации(ИнформацияОбОшибке) Экспорт
	
	ЗаписьЖурналаРегистрации(
			"СтартовыеОкна.Переход по навигационной ссылке", 
			УровеньЖурналаРегистрации.Ошибка,,, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
КонецПроцедуры
#КонецОбласти
